switch_order_api_reference/switch_order_api_reference_Python_Structure.ipynb

{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "ed96d399-dd5f-44f5-9150-6b8b23024fca",
   "metadata": {},
   "source": [
    "# SWITCH Order Entry API Python Reference Structure\n",
    "\n",
    "This notebook provides a Python reference structure for the **SWITCH Order Entry API** used in the **BSE Star MF Web Services platform**.\n",
    "\n",
    "The SWITCH Order Entry API allows members to switch an investment from one mutual fund scheme to another scheme.\n",
    "\n",
    "In a switch transaction:\n",
    "\n",
    "• Units are redeemed from the **source scheme**  \n",
    "• The redeemed amount is invested into the **target scheme**\n",
    "\n",
    "The API request is sent from the **member backend system** to the **BSE Star MF server** using **SOAP Web Services**.\n",
    "\n",
    "API Method used: **switchOrderEntryParam**"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f2a3df74-2438-47a0-928c-5b617d371fba",
   "metadata": {},
   "source": [
    "# API Basic Information"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "7e6deeed-dae8-4832-8276-7f62931fe215",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'API_Name': 'SWITCH Order Entry API',\n",
       " 'API_Method': 'switchOrderEntryParam',\n",
       " 'Endpoint': 'https://bsestarmfdemo.bseindia.com/MFOrderEntry/MFOrder.svc/Secure',\n",
       " 'SOAP_Action': 'http://bsestarmf.in/MFOrderEntry/switchOrderEntryParam'}"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "api_basic_information = {\n",
    "    \n",
    "    \"API_Name\": \"SWITCH Order Entry API\",\n",
    "    \n",
    "    \"API_Method\": \"switchOrderEntryParam\",\n",
    "    \n",
    "    \"Endpoint\": \"https://bsestarmfdemo.bseindia.com/MFOrderEntry/MFOrder.svc/Secure\",\n",
    "    \n",
    "    \"SOAP_Action\": \"http://bsestarmf.in/MFOrderEntry/switchOrderEntryParam\"\n",
    "}\n",
    "\n",
    "api_basic_information"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0062e977-c0ad-44ba-b3e1-db5140f01f20",
   "metadata": {},
   "source": [
    "# SWITCH Order Request Parameter Structure"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "b1aaaf48-bd7e-49de-8740-6acf5c909a49",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'TransCode': 'NEW',\n",
       " 'TransNo': 'YYYYMMDD<usercode>000001',\n",
       " 'OrderId': '',\n",
       " 'UserId': '',\n",
       " 'MemberId': '',\n",
       " 'ClientCode': '',\n",
       " 'FromSchemeCd': '',\n",
       " 'ToSchemeCd': '',\n",
       " 'BuySell': 'SO/SI',\n",
       " 'BuySellType': 'FRESH/ADDITIONAL',\n",
       " 'DPTxn': 'C/N/P',\n",
       " 'OrderVal': '',\n",
       " 'SwitchUnits': '',\n",
       " 'AllUnitsFlag': 'Y/N',\n",
       " 'FolioNo': '',\n",
       " 'Remarks': '',\n",
       " 'KYCStatus': 'Y/N',\n",
       " 'SubBrCode': '',\n",
       " 'EUIN': '',\n",
       " 'EUINVal': 'Y/N',\n",
       " 'MinRedeem': 'Y/N',\n",
       " 'IPAdd': '',\n",
       " 'Password': 'EncryptedPassword',\n",
       " 'PassKey': '',\n",
       " 'Param1': '',\n",
       " 'Param2': '',\n",
       " 'Param3': '',\n",
       " 'Filler1': '',\n",
       " 'Filler2': '',\n",
       " 'Filler3': '',\n",
       " 'Filler4': '',\n",
       " 'Filler5': '',\n",
       " 'Filler6': ''}"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "switch_order_request = {\n",
    "\n",
    "    \"TransCode\": \"NEW\",\n",
    "    \"TransNo\": \"YYYYMMDD<usercode>000001\",\n",
    "    \"OrderId\": \"\",\n",
    "    \"UserId\": \"\",\n",
    "    \"MemberId\": \"\",\n",
    "    \"ClientCode\": \"\",\n",
    "    \"FromSchemeCd\": \"\",\n",
    "    \"ToSchemeCd\": \"\",\n",
    "    \"BuySell\": \"SO/SI\",\n",
    "    \"BuySellType\": \"FRESH/ADDITIONAL\",\n",
    "    \"DPTxn\": \"C/N/P\",\n",
    "    \"OrderVal\": \"\",\n",
    "    \"SwitchUnits\": \"\",\n",
    "    \"AllUnitsFlag\": \"Y/N\",\n",
    "    \"FolioNo\": \"\",\n",
    "    \"Remarks\": \"\",\n",
    "    \"KYCStatus\": \"Y/N\",\n",
    "    \"SubBrCode\": \"\",\n",
    "    \"EUIN\": \"\",\n",
    "    \"EUINVal\": \"Y/N\",\n",
    "    \"MinRedeem\": \"Y/N\",\n",
    "    \"IPAdd\": \"\",\n",
    "    \"Password\": \"EncryptedPassword\",\n",
    "    \"PassKey\": \"\",\n",
    "    \"Param1\": \"\",\n",
    "    \"Param2\": \"\",\n",
    "    \"Param3\": \"\",\n",
    "    \"Filler1\": \"\",\n",
    "    \"Filler2\": \"\",\n",
    "    \"Filler3\": \"\",\n",
    "    \"Filler4\": \"\",\n",
    "    \"Filler5\": \"\",\n",
    "    \"Filler6\": \"\"\n",
    "}\n",
    "\n",
    "switch_order_request"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "25f7d26d-5314-4c5b-994a-685dbf3f151f",
   "metadata": {},
   "source": [
    "# SWITCH Order Response Structure"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "3cfd258a-0a56-440a-a11f-64850b9703dd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'TransactionCode': '',\n",
       " 'UniqueReferenceNumber': '',\n",
       " 'OrderID': '',\n",
       " 'UserID': '',\n",
       " 'MemberID': '',\n",
       " 'ClientCode': '',\n",
       " 'SuccessFlag': '',\n",
       " 'BSERemarks': ''}"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "switch_order_response = {\n",
    "\n",
    "    \"TransactionCode\": \"\",\n",
    "    \"UniqueReferenceNumber\": \"\",\n",
    "    \"OrderID\": \"\",\n",
    "    \"UserID\": \"\",\n",
    "    \"MemberID\": \"\",\n",
    "    \"ClientCode\": \"\",\n",
    "    \"SuccessFlag\": \"\",\n",
    "    \"BSERemarks\": \"\"\n",
    "}\n",
    "\n",
    "switch_order_response"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9271f0fd-a095-4299-8913-91b7175ec8f3",
   "metadata": {},
   "source": [
    "# Sample SOAP Request for SWITCH Order"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "405c5f14-cd99-4506-964d-c6f2cf26954c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "<soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:bses=\"http://bsestarmf.in/\">\n",
      "\n",
      "    <soap:Header xmlns:wsa=\"http://www.w3.org/2005/08/addressing\">\n",
      "        <wsa:Action>http://bsestarmf.in/MFOrderEntry/switchOrderEntryParam</wsa:Action>\n",
      "        <wsa:To>https://bsestarmfdemo.bseindia.com/MFOrderEntry/MFOrder.svc/Secure</wsa:To>\n",
      "    </soap:Header>\n",
      "\n",
      "    <soap:Body>\n",
      "\n",
      "        <bses:switchOrderEntryParam>\n",
      "\n",
      "            <bses:TransCode>NEW</bses:TransCode>\n",
      "            <bses:TransNo>202308010000021</bses:TransNo>\n",
      "            <bses:OrderId></bses:OrderId>\n",
      "            <bses:UserId>1099601</bses:UserId>\n",
      "            <bses:MemberId>10996</bses:MemberId>\n",
      "            <bses:ClientCode>AIN05</bses:ClientCode>\n",
      "            <bses:FromSchemeCd>02-DP</bses:FromSchemeCd>\n",
      "            <bses:ToSchemeCd>B301G</bses:ToSchemeCd>\n",
      "            <bses:BuySell>SO</bses:BuySell>\n",
      "            <bses:BuySellType>FRESH</bses:BuySellType>\n",
      "            <bses:DPTxn>P</bses:DPTxn>\n",
      "            <bses:OrderVal></bses:OrderVal>\n",
      "            <bses:SwitchUnits></bses:SwitchUnits>\n",
      "            <bses:AllUnitsFlag>Y</bses:AllUnitsFlag>\n",
      "            <bses:FolioNo>123456</bses:FolioNo>\n",
      "            <bses:Remarks></bses:Remarks>\n",
      "            <bses:KYCStatus>Y</bses:KYCStatus>\n",
      "            <bses:SubBrCode></bses:SubBrCode>\n",
      "            <bses:EUIN></bses:EUIN>\n",
      "            <bses:EUINVal>N</bses:EUINVal>\n",
      "            <bses:MinRedeem>N</bses:MinRedeem>\n",
      "            <bses:IPAdd></bses:IPAdd>\n",
      "            <bses:Password>EncryptedPassword</bses:Password>\n",
      "            <bses:PassKey>@12345</bses:PassKey>\n",
      "            <bses:Parma1></bses:Parma1>\n",
      "            <bses:Param2></bses:Param2>\n",
      "            <bses:Param3></bses:Param3>\n",
      "            <bses:Filler1></bses:Filler1>\n",
      "            <bses:Filler2></bses:Filler2>\n",
      "            <bses:Filler3></bses:Filler3>\n",
      "            <bses:Filler4></bses:Filler4>\n",
      "            <bses:Filler5></bses:Filler5>\n",
      "            <bses:Filler6></bses:Filler6>\n",
      "\n",
      "        </bses:switchOrderEntryParam>\n",
      "\n",
      "    </soap:Body>\n",
      "\n",
      "</soap:Envelope>\n",
      "\n"
     ]
    }
   ],
   "source": [
    "soap_request = \"\"\"\n",
    "<soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:bses=\"http://bsestarmf.in/\">\n",
    "    \n",
    "    <soap:Header xmlns:wsa=\"http://www.w3.org/2005/08/addressing\">\n",
    "        <wsa:Action>http://bsestarmf.in/MFOrderEntry/switchOrderEntryParam</wsa:Action>\n",
    "        <wsa:To>https://bsestarmfdemo.bseindia.com/MFOrderEntry/MFOrder.svc/Secure</wsa:To>\n",
    "    </soap:Header>\n",
    "    \n",
    "    <soap:Body>\n",
    "        \n",
    "        <bses:switchOrderEntryParam>\n",
    "            \n",
    "            <bses:TransCode>NEW</bses:TransCode>\n",
    "            <bses:TransNo>202308010000021</bses:TransNo>\n",
    "            <bses:OrderId></bses:OrderId>\n",
    "            <bses:UserId>1099601</bses:UserId>\n",
    "            <bses:MemberId>10996</bses:MemberId>\n",
    "            <bses:ClientCode>AIN05</bses:ClientCode>\n",
    "            <bses:FromSchemeCd>02-DP</bses:FromSchemeCd>\n",
    "            <bses:ToSchemeCd>B301G</bses:ToSchemeCd>\n",
    "            <bses:BuySell>SO</bses:BuySell>\n",
    "            <bses:BuySellType>FRESH</bses:BuySellType>\n",
    "            <bses:DPTxn>P</bses:DPTxn>\n",
    "            <bses:OrderVal></bses:OrderVal>\n",
    "            <bses:SwitchUnits></bses:SwitchUnits>\n",
    "            <bses:AllUnitsFlag>Y</bses:AllUnitsFlag>\n",
    "            <bses:FolioNo>123456</bses:FolioNo>\n",
    "            <bses:Remarks></bses:Remarks>\n",
    "            <bses:KYCStatus>Y</bses:KYCStatus>\n",
    "            <bses:SubBrCode></bses:SubBrCode>\n",
    "            <bses:EUIN></bses:EUIN>\n",
    "            <bses:EUINVal>N</bses:EUINVal>\n",
    "            <bses:MinRedeem>N</bses:MinRedeem>\n",
    "            <bses:IPAdd></bses:IPAdd>\n",
    "            <bses:Password>EncryptedPassword</bses:Password>\n",
    "            <bses:PassKey>@12345</bses:PassKey>\n",
    "            <bses:Parma1></bses:Parma1>\n",
    "            <bses:Param2></bses:Param2>\n",
    "            <bses:Param3></bses:Param3>\n",
    "            <bses:Filler1></bses:Filler1>\n",
    "            <bses:Filler2></bses:Filler2>\n",
    "            <bses:Filler3></bses:Filler3>\n",
    "            <bses:Filler4></bses:Filler4>\n",
    "            <bses:Filler5></bses:Filler5>\n",
    "            <bses:Filler6></bses:Filler6>\n",
    "        \n",
    "        </bses:switchOrderEntryParam>\n",
    "        \n",
    "    </soap:Body>\n",
    "    \n",
    "</soap:Envelope>\n",
    "\"\"\"\n",
    "\n",
    "print(soap_request)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6b2febed-0a63-489c-b89b-d68bd1bea6ec",
   "metadata": {},
   "source": [
    "# Sample SOAP Response for SWITCH Order"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "48fa119c-5e72-4f2b-97e4-8fe21645c29e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "<s:Envelope xmlns:s=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:a=\"http://www.w3.org/2005/08/addressing\">\n",
      "\n",
      "    <s:Header>\n",
      "        <a:Action s:mustUnderstand=\"1\">\n",
      "        http://bsestarmf.in/MFOrderEntry/switchOrderEntryParamResponse\n",
      "        </a:Action>\n",
      "    </s:Header>\n",
      "\n",
      "    <s:Body>\n",
      "\n",
      "        <switchOrderEntryParamResponse xmlns=\"http://bsestarmf.in/\">\n",
      "\n",
      "            <switchOrderEntryParamResult>\n",
      "            NEW|202308010000021|9793068|123401|1234|clientcode01|\n",
      "            YOUR REQUEST HAS BEEN CONFIRMED, ORDER NO: 9793068|0\n",
      "            </switchOrderEntryParamResult>\n",
      "\n",
      "        </switchOrderEntryParamResponse>\n",
      "\n",
      "    </s:Body>\n",
      "\n",
      "</s:Envelope>\n",
      "\n"
     ]
    }
   ],
   "source": [
    "soap_response = \"\"\"\n",
    "<s:Envelope xmlns:s=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:a=\"http://www.w3.org/2005/08/addressing\">\n",
    "    \n",
    "    <s:Header>\n",
    "        <a:Action s:mustUnderstand=\"1\">\n",
    "        http://bsestarmf.in/MFOrderEntry/switchOrderEntryParamResponse\n",
    "        </a:Action>\n",
    "    </s:Header>\n",
    "    \n",
    "    <s:Body>\n",
    "        \n",
    "        <switchOrderEntryParamResponse xmlns=\"http://bsestarmf.in/\">\n",
    "            \n",
    "            <switchOrderEntryParamResult>\n",
    "            NEW|202308010000021|9793068|123401|1234|clientcode01|\n",
    "            YOUR REQUEST HAS BEEN CONFIRMED, ORDER NO: 9793068|0\n",
    "            </switchOrderEntryParamResult>\n",
    "        \n",
    "        </switchOrderEntryParamResponse>\n",
    "    \n",
    "    </s:Body>\n",
    "\n",
    "</s:Envelope>\n",
    "\"\"\"\n",
    "\n",
    "print(soap_response)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f558226e-43ea-4c8c-97da-b03f32bcd8c4",
   "metadata": {},
   "source": [
    "# Summary\n",
    "\n",
    "The SWITCH Order Entry API allows investors to transfer their investment from one mutual fund scheme to another scheme within the BSE Star MF platform.\n",
    "\n",
    "The process involves two operations:\n",
    "\n",
    "• Redemption of units from the source mutual fund scheme  \n",
    "• Purchase of units in the target mutual fund scheme\n",
    "\n",
    "The API request is sent from the member system to the BSE Star MF server using SOAP Web Services.\n",
    "\n",
    "The request contains transaction details such as client information, scheme codes, transaction type, and authentication credentials.\n",
    "\n",
    "After processing the request, the BSE server returns a SOAP response containing the order confirmation details including the unique order ID and transaction status."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "13c3fc22-bbf8-440c-a8ba-7697fd653397",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
